 // 5. Написать программу вычисления значения функции y=f(a)

double Sin(int a)
{
    return  Math.Sin(a);                     // взял название метода в интернете ,аргументом стало значение приходящее в метод Sin
}

Console.WriteLine(Sin(10));