// 2. Даны два числа. Показать большее и меньшее число

void a(int b, int c)                                   // До метода с возвращаемым типом данных string || int додуматься не могу
{
   
    if (b > c)
    {
        Console.WriteLine(b + " " + c);
    }
    else Console.WriteLine(c + " " + b);

}
a(7, 3);
